{
    "Name":"Krists Auders", 
    "Address":"120 Westlake Ave N Apt 1024, Seattle WA - 98109",
    "Phone": "(858) 822-8604 (cell)",
    "Email": "kristsauders@gmail.com",
    "OBJECTIVE": "User experience developer and rapid prototyper with a keen sense of usability and design, looking for highly challenging work taking concepts all the way to finished products.",
    "SKILLS SUMMARY": {
        "Software Languages/Environments": {
            "Client": "AngularJS, Knockout, Twitter Bootstrap, JQuery (Mobile/UI), YUI 3, HTML5, CSS3;",
            "Server": "C#, MVC4, Node.JS, Ruby, Perl, Java/JSP;",
            "Database": "MongoDB, Riak, MySQL, CouchDB, Google Cloud Storage API, Amazon S3;",
            "Scientific/Parallel": "Matlab, FORTRAN with MPI, C/C++."
        },
        "Tools": {
            "Virtualization": "OpenStack, AWS, VMWare Fusion, Hyper-V, VirtualBox, Proxmox VE, Parallels;",
            "PaaS": "Micro Cloud Foundry, Google App Engine, Appfog, Stackato, Azure, Heroku, OpenShift;",
            "Web Hosting": "Nginx, Apache, Tomcat, Sinatra, Jetty, BIND, Drupal;",
            "Server Administration": "Jenkins, Webmin, Parallels Plesk, Apigee Key Manager;",
            "Networking": "Wireshark, Nessus, tcpdump, netcat, curl, aircrack-ng suite, SoapUI;",
            "Monitoring": "Graphite, Nagios, Apigee Control Center, Google Analytics, Browsermob, WebMetrics;",
            "IDE": "Visual Studio, Cloud9 IDE, XML Spy, Eclipse, Xcode, Aptana;",
            "Miscellaneous": "Travis CI, Github, GitLab, Mercurial, Quality Centre, Visio."
        },
        "Protocols": {
            "Web Services": "RESTful, SOAP, ParlayX, OAuth, JSONP, CORS;",
            "Network": "ARP/DHCP, DNS, BGP, TCP/IP;",
            "Data": "SMPP, HTTP, SCP, SFTP, SSL/TLS, SSH."
        }
    },
    "PROFESSIONAL EXPERIENCE": [
        {
            "Title": "Software Development Engineer (UX)",
            "Employer": "DS-IQ (Bellevue, WA)",
            "Dates": "January 2013 - present",
            "Details": [
                "Worked on a small team to build brand new single page applications from scratch;",
                "Researched and prototyped solutions using different new technologies;",
                "Conducted performance analysis and optimizations of all applications;",
                "Supported legacy applications for bugs and new features;",
                "Troubleshot bugs and performance issues in all environments;",
                "Developed in Javascript and HTML, using AngularJS and JQuery Mobile, as well as server side work with C# and MVC4."
            ]
        },
        {
            "Title": "Professional-Technical Architect",
            "Employer": "AT&T, Applications and Services Infrastructure (Redmond, WA)",
            "Dates": "July 2012 - December 2012",
            "Details": [
                "Worked on AT&T API Platform, part of the AT&T Developer Program (http://developer.att.com);",
                "Lead project to design, develop and deploy a new set of tools for API design, documentation and publishing;",
                "Served as technical lead in architecting and deploying a large site redesign by migrating all existing documentation to a new content management system, guided by final wireframes, comps and business needs, with budget restrictions;",
                "Designed and supported multiple large usability studies of the API Platform and website, and worked to resolve all found issues;",
                "Supported multiple AT&T Hackathons as a technical expert and evangelist;",
                "Represented technical team to marketing and business stakeholders responsible for feature planning and user flow design;",
                "Built JavaScript plugin prototype and documentation for accessing AT&T APIs, to gain support for implementing proper Cross Origin Resource Sharing (CORS) (http://attjs.kristsauders.com);",
                "Managed Github repository structure for AT&T API Platform (https://github.com/attdevsupport);",
                "Main administrator/manager of Linux & Windows servers hosting demos and documentation of all sample code, SDKs, and other tools for the program;",
                "Wrote numerous tools/scripts for automation and testing in various languages."
            ]
        },
        {
            "Title": "Wireless Architect",
            "Employer": "Sentaca, Inc. - Contractor at AT&T (Redmond, WA)",
            "Dates": "January 2011 - July 2012",
            "Details": [
                "Worked on AT&T API Platform, part of the AT&T Developer Program (http://developer.att.com);",
                "Designed and developed suite of prototype sample applications for developers in Java and Ruby;",
                "Managed further design and development of sample applications in other languages/platforms;",
                "Designed and developed suite of browser based tools for testing APIs, used by multiple teams;",
                "Designed and developed many internal solutions, such as a notification proxy and an automated source code wiki page (Github Gist) builder;",
                "Planned and managed all private and public Github source code repositories for the AT&T API Platform;",
                "Planned and managed source code management, testing and deployment procedures;",
                "Managed 7 sample code and documentation servers, including full design and deployment, stability testing and monitoring, and a complete migration to a new infrastructure with minimal downtime;",
                "Designed and built a full set of API and Tool monitoring test cases using Browsermob/WebMetrics;",
                "Worked with Marketing team on a large scale usability improvement project, including repeated usability testing and complete redesign of online documentation, application provisioning interface, and sign up process;",
                "Researched, deployed and managed a public facing API discovery/exploration tool, the Apigee API Console, which was one of the platform's most visible assets;",
                "Worked on end-to-end developer and user experience testing, and provided Tier-3 support to large enterprise customers with edge case technical issues, as well as worked closely with developers using our platform to find out what they needed;",
                "Assisted in weekly reporting and analytics for platform usage, tracking data and creating reports for Marketing executives."
            ]
        },
        {
            "Title": "IT Specialist",
            "Employer": "UCSD Housing, Dining & Hospitality Info Technologies Dept. (San Diego, CA)",
            "Dates": "March 2009 - August 2010",
            "Details": [
                "Administered domain controller server and user/machine domain accounts/group policy/client logon scripts, print server, Windows XP/7 deployment servers, DHCP server, web application servers on Windows 98/XP/7/2008R2;",
                "Managed web servers for Kronos, Maximo, Sharepoint and other databases;",
                "Played an integral role in building, deploying and managing server room and entire network of hardware and software for new administration building, for approximately 400 university employees;",
                "Conducted research for deploying new software and reorganizing network structure, with responsibility for reliability and security of deployed hardware and software;",
                "Deployed new building-wide print server for Xerox printer/copier machines with SecureAccess functionality;",
                "Assisted in deploying Persona Lock system and database, and programming electronic door lock system for entire new student housing complex providing over 1000 beds."
            ]
        }
    ],
    "PERSONAL PROJECTS": [
        {
            "Title": "Interactive Online Résumé",
            "Details": [
                "Available at kristsauders.com/resume",
                "Frontend design with JQuery, Twitter Bootstrap;",
                "Backend built with Node.JS, using Express, through an Nginx proxy;",
                "Résumé is stored as a JSON document, HTML and PDF versions are rendered programmatically;",
                "Texting and calling features use the ATT-JS Javascript plugin I wrote;",
                "API logic uses Restler, and e-mails sent using Nodemailer."
            ]
        },
        {
            "Title": "Drag & Drop Online Portfolio/Gallery Builder (http://tabletop.kristsauders.com)",
            "Details": [
                "Frontend design with JQuery, CSS3, HTML5 Canvas;",
                "Backend built with Node.JS, using Express;",
                "MongoDB database for all non-binary data;",
                "Image conversion into multiple sizes using ImageMagick, for bandwidth optimization;",
                "Full support for signup, gallery buildling, publishing, drawing, etc.."
            ]
        },
        {
            "Title": "Prototype for tablet focused menu/feedback web app (http://www.cs.washington.edu/education/courses/csep510/12sp/projects/restaurant2.0/index.html)",
            "Details": [
                "Class project for graduate level Human Computer Interaction class;",
                "Frontend design with CSS3, HTML5, Javascript;",
                "YUI3 used for dynamically loading external content into view."
            ]
        },
        {
            "Title": "Numerous small tools for using different APIs (https://github.com/kristsauders)",
            "Details": [
                "Twitter API tool to find followers who have tweeted certain keywords/hashtags in a specified timeframe;",
                "Meteor Solutions API for finding social media conversions from a list of campaigns;",
                "Facebook API integration for photography site, to pull existing photos from Facebook."
            ]
        }
    ],
    "EDUCATION": [
        {
            "School": "University of Washington (http://uw.edu)",
            "Subject": "Graduate Level Courses in Computer Science & Applied Mathematics",
            "Dates": "2010 - 2012"
        },
        {
            "School": "University of California, San Diego (http://ucsd.edu)",
            "Subject": "Bachelor's Degree, Mathematics",
            "Dates": "2007 - 2010"
        }
    ]
}
